------------------------------------------------------------------------
-- The Lambek Calculus in Agda
------------------------------------------------------------------------


open import Function           using (flip; _$_)
open import Data.Product       using (Σ; _,_)
open import Data.List          using (List; _∷_; [])
open import Data.List.NonEmpty using (List⁺; _∷_)
open import Reflection         using (type)


module Example.NLIBC where


open import Example.System.NLIBC public


postulate
  MARY                : Entity
  JOHN                : Entity
  SPEAKER             : Entity
  SLAUGHTERHOUSE-FIVE : Entity
  BOOK                : Entity → Bool
  PERSON              : Entity → Bool
  AUTHOR              : Entity → Bool
  READ                : Entity → Entity → Bool
  LEFT                : Entity → Bool
  LIKE                : Entity → Entity → Bool
  KNOW                : Entity → Entity → Bool
  THINK               : Entity → Bool → Bool
  THE                 : (Entity → Bool) → Entity
  SAME                : (((Entity → Bool) → Entity → Bool) → Entity → Bool) → Entity → Bool
  OF                  : Entity → (Entity → Bool) → Entity → Bool
  _WITH-APPOSITIVE_   : Entity → Bool → Entity


data Word : Set where
  I mary john
    book person author like know
      read left likes thinks
        a everyone someone
          the same who which of slaughterhouse-five : Word


Lex : Word → List⁺ (Σ Type ⟦_⟧ᵗ)
Lex I                   = (np , SPEAKER) ∷ []
Lex mary                = (np , MARY) ∷ []
Lex john                = (np , JOHN) ∷ []
Lex slaughterhouse-five = (np , SLAUGHTERHOUSE-FIVE) ∷ []
Lex book                = (n  , BOOK) ∷ []
Lex person              = (n  , PERSON) ∷ []
Lex author              = (n  , AUTHOR) ∷ []
Lex left                = (iv , LEFT) ∷ []
Lex know                = (tv , (λ y x → KNOW x y)) ∷ []
Lex like                = (tv , (λ y x → LIKE x y)) ∷ []
Lex likes               = (tv , (λ y x → LIKE x y)) ∷ []
Lex read                = (tv , (λ y x → READ x y)) ∷ []
Lex thinks              = (iv ⇐ s , (λ y x → THINK x y)) ∷ []
Lex a                   = ((s ⇦ (np ⇨ s)) ⇐ n , (λ p₁ p₂ → EXISTS (λ x → p₁ x ∧ p₂ x))) ∷ []
Lex someone             = (s ⇦ (np ⇨ s) , (λ p → EXISTS (λ x → PERSON x ∧ p x))) ∷ []
Lex everyone            = (s ⇦ (np ⇨ s) , (λ p → FORALL (λ x → PERSON x ⊃ p x))) ∷ []
Lex the                 = (np ⇐ n , THE) ∷ []
Lex same                = (n ⇦ ((n ⇐ n) ⇨ n) , SAME)
                        ∷ ((np ⇨ s) ⇦ ((n ⇐ n) ⇨ (np ⇨ s)) , SAME) ∷ []
Lex who                 = (q ⇐ (np ⇨ s) , (λ p → THE p))
                        ∷ ((n ⇒ n) ⇐ (np ⇨ s) , (λ p₂ p₁ x → p₁ x ∧ p₂ x))
                        ∷ []
Lex which               = ((np ⇒ np) ⇐ (np ⇨ s) ⇦ (np ⇨ np)
                        , (λ f p x → x WITH-APPOSITIVE p (f x))) ∷ []
Lex of                  = ((n ⇒ n) ⇐ np , (λ y p x → OF x p y)) ∷ []


open Lexicon (fromLex grammar Lex) public
     using (✓_; *_; Parse_as_; parse_as_; interpret_as_; interpret; interpretParse)


s₁ : interpret · mary · , · likes · , · john · as s
   ↦ LIKE MARY JOHN
s₁ = _

s₂ : interpret · john · , · likes · , · everyone · as s
   ↦ FORALL (λ x → PERSON x ⊃ LIKE JOHN x)
s₂ = _

s₃ : interpret · everyone · , · likes · , · john · as s
   ↦ FORALL (λ x → PERSON x ⊃ LIKE x JOHN)
s₃ = _

s₄ : interpret · someone · , · likes · , · everyone · as s
   ↦ [ EXISTS (λ y → PERSON y ∧ FORALL (λ x → PERSON x ⊃ LIKE y x))
     , FORALL (λ x → PERSON x ⊃ EXISTS (λ y → PERSON y ∧ LIKE y x))
     ]
s₄ = _

s₅ : interpret · who · , · likes · , · mary · as q
   ↦ THE (λ x → LIKE x MARY)
s₅ = _

s₆ : interpret (· a · , · person · , (· who · , · mary · , · likes ·)) , · left · as s
   ↦ EXISTS (λ x → (PERSON x ∧ LIKE MARY x) ∧ LEFT x)
s₆ = _

s₇ : interpret · john · , · likes · , · the · , (· author · , · of · , · slaughterhouse-five ·) as s
   ↦ LIKE JOHN (THE (λ x → OF x AUTHOR SLAUGHTERHOUSE-FIVE))
s₇ = _


module s₈ where

  -- The idea behind this module is as follows: searching with the
  -- full rule ⇨ᴸλ is beyond the capabilities of Agda, as the search
  -- space gets too big. Therefore, we have implemented the following
  -- proof (syn) manually.
  -- Afterwards, we have used a proof search algorithm we implemented
  -- in Haskell to find the remaining proofs.
  -- The last line of this module checks if the semantics given to our
  -- manually found proof are identical to the remaining proofs.

  phr : Struct Word
  phr = · I · , · read ·
    , ( · a · , · book ·)
    , ( · the · , · author · , · of · , · which ·)
    , ( · I · , · know · )

  syn : Parse phr as s
  syn =         ⇐ᴸ  (_ ∙> (_ ∙> ([] <∙ _))) ax                 -- combine `a book'
       $ flip ( ⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _)))) ax             -- QR `a_book' up
       $        ⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _)))                    -- QR `a_book' down
       $ flip ( ⇐ᴸ  (_ ∙> [])) (⇒ᴸ [] ax ax)                   -- combine `I read NP'
       $        ⇦ᴸλ (_ ∙> ([] <∙ _)) (_ ∙> (_ ∙> (_ ∙> [])))   -- QR `which' up
              ( ⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> [])))                    -- QR `which' down
              $ ⇐ᴸ  (_ ∙> _ ∙> []) ax                          -- combine `of which'
              $ ⇒ᴸ  (_ ∙> []) ax                               -- combine `author ow'
              $ ⇐ᴸ  [] ax ax                                   -- combine `the aow'
              )
       $ flip (⇐ᴸ   (_ ∙> [])) (⇒ᴸ [] ax ax)                  -- insert `a_book' into `taow'
       $       ⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) -- insert `abtoaw' into `I know'

  sem : ⟦ s ⟧ᵗ
  sem = interpretParse {phr} syn

  syn1  syn2  syn3  syn4  syn5  syn6  syn7  syn8  syn9  syn10 syn11 syn12 syn13 syn14 syn15 : Parse phr as s
  syn16 syn17 syn18 syn19 syn20 syn21 syn22 syn23 syn24 syn25 syn26 syn27 syn28 syn29 syn30 : Parse phr as s
  syn31 syn32 syn33 syn34 syn35 syn36 syn37 syn38 syn39 syn40 syn41 syn42 syn43 syn44 syn45 : Parse phr as s
  syn46 syn47 syn48 syn49 syn50 syn51 syn52 syn53 syn54 syn55 syn56 syn57 syn58 syn59 syn60 : Parse phr as s
  syn61 syn62 syn63 syn64 syn65 syn66 syn67 syn68 syn69 syn70 syn71 syn72 syn73 syn74 syn75 : Parse phr as s

  syn1 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn2 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn3 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn4 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn5 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn6 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn7 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn8 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn9 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn10 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn11 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn12 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn13 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn14 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn15 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn16 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇦ᴸλ (_ ∙> ([] <∙ _)) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) ax))
  syn17 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇦ᴸλ (_ ∙> ([] <∙ _)) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) ax))
  syn18 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇦ᴸλ (_ ∙> ([] <∙ _)) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax))) ax))
  syn19 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn20 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn21 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn22 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn23 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn24 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn25 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax)))) ax))
  syn26 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))))) ax))
  syn27 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))))) ax))
  syn28 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn29 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn30 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn31 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn32 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn33 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn34 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn35 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn36 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn37 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn38 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn39 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn40 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn41 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn42 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn43 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn44 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn45 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn46 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn47 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn48 = (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn49 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn50 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn51 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn52 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn53 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn54 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn55 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn56 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn57 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ [] (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)) ax)) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn58 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn59 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn60 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn61 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn62 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn63 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn64 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn65 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn66 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ [] (⇒ᴸ [] ax ax) ax))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn67 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn68 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))
  syn69 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn70 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn71 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇐ᴸ (_ ∙> []) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ [] ax ax)) (⇒ᴸ [] ax ax))) ax)))
  syn72 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax)))) ax)))
  syn73 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))))) ax)))
  syn74 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇐ᴸ (_ ∙> []) (⇒ᴸ [] ax ax) (⇒ᴸ [] ax ax))) ax))))
  syn75 = (⇦ᴸλ (_ ∙> (_ ∙> (_ ∙> ([] <∙ _)))) (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿλ (_ ∙> (_ ∙> (_ ∙> []))) (⇐ᴸ (_ ∙> (_ ∙> [])) ax (⇒ᴸ (_ ∙> []) ax (⇐ᴸ [] ax ax)))) (⇐ᴸ (_ ∙> (_ ∙> (_ ∙> []))) (⇨ᴿgᴿ (_ ∙> []) (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax))) (⇐ᴸ (_ ∙> (_ ∙> ([] <∙ _))) ax (⇦ᴸλ [] (_ ∙> (_ ∙> ([] <∙ _))) (⇨ᴿλ (_ ∙> (_ ∙> ([] <∙ _))) (⇒ᴸ (_ ∙> (_ ∙> [])) ax (⇐ᴸ (_ ∙> []) ax (⇒ᴸ [] ax ax)))) ax))))

  sem* : List ⟦ s ⟧ᵗ
  sem* = interpretParse {phr} syn1  ∷ interpretParse {phr} syn2  ∷ interpretParse {phr} syn3
       ∷ interpretParse {phr} syn4  ∷ interpretParse {phr} syn5  ∷ interpretParse {phr} syn6
       ∷ interpretParse {phr} syn7  ∷ interpretParse {phr} syn8  ∷ interpretParse {phr} syn9
       ∷ interpretParse {phr} syn10 ∷ interpretParse {phr} syn11 ∷ interpretParse {phr} syn12
       ∷ interpretParse {phr} syn13 ∷ interpretParse {phr} syn14 ∷ interpretParse {phr} syn15
       ∷ interpretParse {phr} syn16 ∷ interpretParse {phr} syn17 ∷ interpretParse {phr} syn18
       ∷ interpretParse {phr} syn19 ∷ interpretParse {phr} syn20 ∷ interpretParse {phr} syn21
       ∷ interpretParse {phr} syn22 ∷ interpretParse {phr} syn23 ∷ interpretParse {phr} syn24
       ∷ interpretParse {phr} syn25 ∷ interpretParse {phr} syn26 ∷ interpretParse {phr} syn27
       ∷ interpretParse {phr} syn28 ∷ interpretParse {phr} syn29 ∷ interpretParse {phr} syn30
       ∷ interpretParse {phr} syn31 ∷ interpretParse {phr} syn32 ∷ interpretParse {phr} syn33
       ∷ interpretParse {phr} syn34 ∷ interpretParse {phr} syn35 ∷ interpretParse {phr} syn36
       ∷ interpretParse {phr} syn37 ∷ interpretParse {phr} syn38 ∷ interpretParse {phr} syn39
       ∷ interpretParse {phr} syn40 ∷ interpretParse {phr} syn41 ∷ interpretParse {phr} syn42
       ∷ interpretParse {phr} syn43 ∷ interpretParse {phr} syn44 ∷ interpretParse {phr} syn45
       ∷ interpretParse {phr} syn46 ∷ interpretParse {phr} syn47 ∷ interpretParse {phr} syn48
       ∷ interpretParse {phr} syn49 ∷ interpretParse {phr} syn50 ∷ interpretParse {phr} syn51
       ∷ interpretParse {phr} syn52 ∷ interpretParse {phr} syn53 ∷ interpretParse {phr} syn54
       ∷ interpretParse {phr} syn55 ∷ interpretParse {phr} syn56 ∷ interpretParse {phr} syn57
       ∷ interpretParse {phr} syn58 ∷ interpretParse {phr} syn59 ∷ interpretParse {phr} syn60
       ∷ interpretParse {phr} syn61 ∷ interpretParse {phr} syn62 ∷ interpretParse {phr} syn63
       ∷ interpretParse {phr} syn64 ∷ interpretParse {phr} syn65 ∷ interpretParse {phr} syn66
       ∷ interpretParse {phr} syn67 ∷ interpretParse {phr} syn68 ∷ interpretParse {phr} syn69
       ∷ interpretParse {phr} syn70 ∷ interpretParse {phr} syn71 ∷ interpretParse {phr} syn72
       ∷ interpretParse {phr} syn73 ∷ interpretParse {phr} syn74 ∷ interpretParse {phr} syn75
       ∷ []

  --check : sem* ↦ sem
  --check = _


--s₉ : interpret · everyone · ,  · read · , · the · , · same · , · book · as s
--   ↦ [ FORALL (λ x → PERSON x ⊃ READ x (THE (SAME (λ f → f BOOK))))
--     , FORALL (λ x → PERSON x ⊃ SAME (λ f y → READ y (THE (f BOOK))) x)
--     ]
--s₉ = _

-- I don't think there's a difference between restrictive and
-- appositive modifiers. I should try this out: interpret np as a set
-- of entities, and n as the same type.  If that works out, then we
-- can analyse both restrictive and appositive modifiers as
-- restrictive functions on sets. Therefore, if I say something about
-- John in an appositive clause which isn't true, then the set empties
-- and we get the same sort of crash that we would expect. Motivating
-- example here is:
--
--   "I read a book the author of which I like."
--
-- Interpreted in the context where I don't know any authors."


-- -}
-- -}
-- -}
-- -}
-- -}
